fio/test_suite_sd_results/bs4k_write100.txt
bs4k_write100: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs4k_write100: Laying out IO file (1 file / 100MiB)
bs4k_write100: Laying out IO file (1 file / 100MiB)
bs4k_write100: Laying out IO file (1 file / 100MiB)
[...]

bs4k_write100: (groupid=0, jobs=4): err= 0: pid=3234: Sun Jun  8 21:23:32 2025
  write: IOPS=1437, BW=5751KiB/s (5889kB/s)(210MiB/37455msec); 0 zone resets
    clat (usec): min=9, max=9238.7k, avg=2777.43, stdev=97684.12
     lat (usec): min=9, max=9238.7k, avg=2778.00, stdev=97684.15
    clat percentiles (usec):
     |  1.00th=[     10],  5.00th=[     10], 10.00th=[     11],
     | 20.00th=[     12], 30.00th=[     13], 40.00th=[     14],
     | 50.00th=[     15], 60.00th=[     16], 70.00th=[     18],
     | 80.00th=[     21], 90.00th=[     24], 95.00th=[     30],
     | 99.00th=[    123], 99.50th=[ 202376], 99.90th=[ 204473],
     | 99.95th=[ 204473], 99.99th=[5872026]
   bw (  KiB/s): min=   32, max=235640, per=100.00%, avg=10013.05, stdev=8801.92, samples=172
   iops        : min=    8, max=58910, avg=2502.40, stdev=2200.52, samples=172
  lat (usec)   : 10=5.86%, 20=72.87%, 50=18.57%, 100=1.43%, 250=0.38%
  lat (usec)   : 500=0.03%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.01%, 10=0.01%, 100=0.03%, 250=0.76%, >=2000=0.02%
  cpu          : usr=0.22%, sys=0.58%, ctx=621, majf=0, minf=111
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,53849,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=5751KiB/s (5889kB/s), 5751KiB/s-5751KiB/s (5889kB/s-5889kB/s), io=210MiB (221MB), run=37455-37455msec

Disk stats (read/write):
  mmcblk0: ios=0/316, merge=0/44, ticks=0/1281473, in_queue=1281474, util=94.55%