fio/test_suite_sd_results/bs512k_read100.txt
bs512k_read100: (g=0): rw=read, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs512k_read100: Laying out IO file (1 file / 100MiB)
bs512k_read100: Laying out IO file (1 file / 100MiB)
bs512k_read100: Laying out IO file (1 file / 100MiB)
[...]

bs512k_read100: (groupid=0, jobs=4): err= 0: pid=3768: Sun Jun  8 22:19:01 2025
  read: IOPS=43, BW=21.9MiB/s (22.9MB/s)(659MiB/30148msec)
    clat (msec): min=4, max=233, avg=91.07, stdev=68.80
     lat (msec): min=4, max=233, avg=91.08, stdev=68.80
    clat percentiles (msec):
     |  1.00th=[   23],  5.00th=[   23], 10.00th=[   23], 20.00th=[   23],
     | 30.00th=[   23], 40.00th=[   23], 50.00th=[   69], 60.00th=[  159],
     | 70.00th=[  159], 80.00th=[  159], 90.00th=[  161], 95.00th=[  163],
     | 99.00th=[  178], 99.50th=[  211], 99.90th=[  234], 99.95th=[  234],
     | 99.99th=[  234]
   bw (  KiB/s): min=16357, max=27648, per=100.00%, avg=22425.34, stdev=819.74, samples=239
   iops        : min=   29, max=   54, avg=43.15, stdev= 1.64, samples=239
  lat (msec)   : 10=0.08%, 50=49.85%, 100=0.53%, 250=49.54%
  cpu          : usr=0.04%, sys=1.73%, ctx=1366, majf=0, minf=607
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1318,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=21.9MiB/s (22.9MB/s), 21.9MiB/s-21.9MiB/s (22.9MB/s-22.9MB/s), io=659MiB (691MB), run=30148-30148msec

Disk stats (read/write):
  mmcblk0: ios=1316/9, merge=1/2, ticks=236091/4624, in_queue=240716, util=93.73%