fio/test_suite_sd_results/bs512k_read40write60.txt
bs512k_read40write60: (g=0): rw=randrw, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs512k_read40write60: Laying out IO file (1 file / 100MiB)
bs512k_read40write60: Laying out IO file (1 file / 100MiB)
bs512k_read40write60: Laying out IO file (1 file / 100MiB)
[...]

bs512k_read40write60: (groupid=0, jobs=4): err= 0: pid=3806: Sun Jun  8 22:24:26 2025
  read: IOPS=2, BW=1425KiB/s (1459kB/s)(54.5MiB/39159msec)
    clat (msec): min=25, max=24311, avg=1084.24, stdev=3406.72
     lat (msec): min=25, max=24311, avg=1084.24, stdev=3406.72
    clat percentiles (msec):
     |  1.00th=[   40],  5.00th=[   77], 10.00th=[   83], 20.00th=[   86],
     | 30.00th=[   88], 40.00th=[   89], 50.00th=[   90], 60.00th=[   90],
     | 70.00th=[   91], 80.00th=[   91], 90.00th=[ 3473], 95.00th=[ 9194],
     | 99.00th=[17113], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min= 4084, max=24576, per=100.00%, avg=14881.25, stdev=2166.52, samples=29
   iops        : min=    4, max=   48, avg=27.96, stdev= 4.59, samples=29
  write: IOPS=5, BW=2589KiB/s (2651kB/s)(99.0MiB/39159msec); 0 zone resets
    clat (usec): min=1255, max=18434k, avg=193300.72, stdev=1847735.34
     lat (usec): min=1383, max=18434k, avg=193450.91, stdev=1847733.93
    clat percentiles (usec):
     |  1.00th=[    1303],  5.00th=[    1319], 10.00th=[    1352],
     | 20.00th=[    1385], 30.00th=[    1434], 40.00th=[    1467],
     | 50.00th=[    1500], 60.00th=[    1516], 70.00th=[    1565],
     | 80.00th=[    2024], 90.00th=[    2573], 95.00th=[    2933],
     | 99.00th=[17112761], 99.50th=[17112761], 99.90th=[17112761],
     | 99.95th=[17112761], 99.99th=[17112761]
   bw (  KiB/s): min=10232, max=59392, per=100.00%, avg=31351.40, stdev=4285.69, samples=26
   iops        : min=   18, max=  116, avg=60.79, stdev= 8.52, samples=26
  lat (msec)   : 2=51.47%, 4=12.05%, 50=0.65%, 100=29.97%, 250=0.65%
  lat (msec)   : 2000=0.33%, >=2000=4.89%
  cpu          : usr=0.04%, sys=0.28%, ctx=145, majf=0, minf=110
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=109,198,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1425KiB/s (1459kB/s), 1425KiB/s-1425KiB/s (1459kB/s-1459kB/s), io=54.5MiB (57.1MB), run=39159-39159msec
  WRITE: bw=2589KiB/s (2651kB/s), 2589KiB/s-2589KiB/s (2651kB/s-2651kB/s), io=99.0MiB (104MB), run=39159-39159msec

Disk stats (read/write):
  mmcblk0: ios=105/103, merge=0/2, ticks=81444/1528275, in_queue=1609719, util=91.13%