fio/test_suite_sd_results/bs64k_read100.txt
bs64k_read100: (g=0): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs64k_read100: Laying out IO file (1 file / 100MiB)
bs64k_read100: Laying out IO file (1 file / 100MiB)
bs64k_read100: Laying out IO file (1 file / 100MiB)
[...]

bs64k_read100: (groupid=0, jobs=4): err= 0: pid=3541: Sun Jun  8 21:49:53 2025
  read: IOPS=335, BW=21.0MiB/s (22.0MB/s)(642MiB/30589msec)
    clat (usec): min=38, max=1338.9k, avg=11858.19, stdev=39583.42
     lat (usec): min=39, max=1338.9k, avg=11859.00, stdev=39583.62
    clat percentiles (usec):
     |  1.00th=[     43],  5.00th=[     45], 10.00th=[     47],
     | 20.00th=[     53], 30.00th=[     71], 40.00th=[     73],
     | 50.00th=[     75], 60.00th=[     80], 70.00th=[     88],
     | 80.00th=[    433], 90.00th=[  89654], 95.00th=[  89654],
     | 99.00th=[  90702], 99.50th=[  91751], 99.90th=[  96994],
     | 99.95th=[  98042], 99.99th=[1333789]
   bw (  KiB/s): min= 9194, max=24576, per=100.00%, avg=22253.66, stdev=668.57, samples=236
   iops        : min=  140, max=  384, avg=345.56, stdev=10.48, samples=236
  lat (usec)   : 50=17.52%, 100=55.17%, 250=3.13%, 500=10.07%, 750=1.16%
  lat (usec)   : 1000=0.07%
  lat (msec)   : 2=0.23%, 4=0.01%, 10=0.02%, 20=0.06%, 50=0.09%
  lat (msec)   : 100=12.43%, 250=0.01%, 2000=0.04%
  cpu          : usr=0.10%, sys=1.49%, ctx=1354, majf=0, minf=168
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=10276,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=21.0MiB/s (22.0MB/s), 21.0MiB/s-21.0MiB/s (22.0MB/s-22.0MB/s), io=642MiB (673MB), run=30589-30589msec

Disk stats (read/write):
  mmcblk0: ios=1295/2, merge=1283/1, ticks=115864/2929, in_queue=118794, util=96.93%